cases/DM_analyticalFoam23_4cells/constant/polyMesh/boundary
/*---------------------------------------------------------------------------*\
|       OpenFoam mesh file generated using HyperMesh Version: 2021.0.0.33     |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

3
(
    inlet
    {
        type            patch;
        nFaces          80;
        startFace       45160;
    }
    outlet
    {
        type            patch;
        nFaces          680;
        startFace       45240;
    }
    wall
    {
        type            wall;
        nFaces          10120;
        startFace       45920;
    }
)

// ************************************************************************* //
